{
  "current_version": "19.2",
  "version_history": [
    {
      "version": "1.0",
      "date": "Initial version",
      "changes": "Initial version"
    },
    {
      "version": "13.1",
      "date": "February 19, 2025",
      "changes": "Major update with focus on portability, composability, and properly formatted output, with a refined World Simulation Model module."
    },
    {
      "version": "14.0",
      "date": "February 19, 2025",
      "changes": "Refined core capabilities and agent network, added enhanced sub-menu, toolkits, and monitoring and maintenance instructions."
    },
    {
      "version": "15.0",
      "date": "February 19, 2025",
      "changes": "Improved company selection process to replace generic placeholders with specific examples based on simulated analysis and publicly available information."
    },
    {
      "version": "15.1",
      "date": "February 19, 2025",
      "changes": "Added libraries and archives to help with tracking, trends, and learning."
    },
    {
      "version": "15.2",
      "date": "February 19, 2025",
      "changes": "Implemented simulated data generation, prompt-based data entry, reasoning and simulation, knowledge representation within prompts, and iterative prompt refinement to enhance the functionality of libraries and archives."
    },
    {
      "version": "15.3",
      "date": "February 19, 2025",
      "changes": "Refined data management with modular knowledge base, simulated database interaction, data decay, and automated archiving."
    },
    {
      "version": "16.0",
      "date": "February 22, 2025",
      "changes": "Enhanced core capabilities with prediction market integration, sentiment analysis refinement, alternative data integration, explainable AI (XAI), and personalized learning and adaptation. Added new agents for prediction market analysis and alternative data integration. Refined agent responsibilities and data sources. Expanded and refined prompt with additional context and pre-loaded configurations."
    },
    {
      "version": "16.1",
      "date": "February 24, 2025",
      "changes": "Added Knowledge Base to agent data sources, emphasized Chain-of-Thought prompting and simulated collaborative workflows in instructions, added dynamic task assignment to system operations, incorporated user feedback into monitoring, and detailed Knowledge Base and prompt-based interaction in libraries and archives."
    },
    {
      "version": "17.0",
      "date": "February 24, 2025",
      "changes": "Added Enhanced Prompt Parser, Real-World Data Integration, Dynamic Visualization Engine, Repository Management System, and Feedback and Prompt Refinement Loop modules. Refined instructions to incorporate these modules. Updated agent network and system operations to reflect enhanced capabilities. Standardized file naming conventions for reports and analyses."
    },
    {
      "version": "17.1",
      "date": "February 24, 2025",
      "changes": "Expanded Knowledge Base with detailed financial concepts, modularized knowledge graph, refined agent configurations, updated API communication, and enhanced chatbot UI with knowledge graph visualization and markdown rendering capabilities."
    },
    {
      "version": "18.0",
      "date": "February 24, 2025",
      "changes": "Improved data retrieval with real-time data sources, deeper financial analysis including enhanced valuation models and risk assessment, improved natural language generation with audience-specific tailoring and visualizations, expanded knowledge base, and refined prompt parsing and handling."
    },
    {
      "version": "18.1",
      "date": "February 25, 2025",
      "changes": "Integrated dynamic agent configuration, enhanced knowledge base with graph database, improved data pipeline with validation and alternative data sources, incorporated XAI capabilities, and implemented automated testing and monitoring."
    },
    {
      "version": "19.0",
      "date": "February 26, 2025",
      "changes": "Added SNC Analyst Agent and Crypto Agent. Implemented Credit Rating Assessment Simulation and Investment Committee Simulation workflows. Expanded knowledge base with credit rating methodologies, regulatory guidelines, historical rating data, and crypto asset data. Added new sections to libraries and archives for simulation results and report templates."
    },
    {
      "version": "19.1",
      "date": "March 3, 2025",
      "changes": "Added Legal Agent, Financial Modeling Agent, Supply Chain Risk Agent, Algo Trading Agent, and Discussion Chair Agent. Enhanced persona description to reflect new capabilities."
    },
    {
      "version": "19.2",
      "date": "March 9, 2025",
      "changes": "Implemented core logic for multiple stub agents, including FundamentalAnalystAgent, MarketSentimentAgent, and MacroeconomicAnalysisAgent. Expanded data retrieval capabilities in data_utils.py. Improved error handling in existing agents and system components. Expanded knowledge_base.json with more financial concepts and relationships. Created llm_plugin.py for LLM integration in QueryUnderstandingAgent. Modified data files based on LLM suggestions. Added unit tests for DataRetrievalAgent."
    }
  ],
  "component_versions": {
    "core": "1.5.0",
    "config": "1.3.0",
    "data": "1.4.0",
    "docs": "1.3.0",
    "scripts": "1.3.0",
    "tests": "1.4.0"
  },
  "dependencies": {
    "langchain": "0.0.123",
    "pandas": "1.5.3",
    "numpy": "1.24.2",
    "neo4j": "5.11.0",
    "shap": "0.42.1",
    "lime": "0.2.0.1",
    "prometheus_client": "0.16.0"
    // ... other dependencies
  },
  "release_notes": {
    "18.0": "Major update with enhanced data retrieval, deeper financial analysis, improved natural language generation, and expanded knowledge base.",
    "18.1": "Enhanced dynamic agent configuration, knowledge base with graph database, data pipeline with validation and alternative data, XAI capabilities, and automated testing and monitoring.",
    "19.0": "Added SNC Analyst Agent and Crypto Agent. Implemented Credit Rating Assessment Simulation and Investment Committee Simulation workflows. Expanded knowledge base and libraries and archives.",
    "19.1": "Added Legal Agent, Financial Modeling Agent, Supply Chain Risk Agent, Algo Trading Agent, and Discussion Chair Agent for enhanced analysis and simulation capabilities.",
    "19.2": "Implemented core logic for multiple stub agents, including FundamentalAnalystAgent, MarketSentimentAgent, and MacroeconomicAnalysisAgent. Expanded data retrieval capabilities. Improved error handling. Expanded knowledge base. Integrated LLM for natural language understanding. Added unit tests."
  }
}
