{"rank": 1, "ticker": "NVDA", "company": "NVIDIA Corporation", "conviction_score": 245, "outlook": "Strong Buy", "rationale": "Dominant AI ecosystem lock-in (CUDA) and near-monopoly margins in Data Center. Projected revenue growth >75% yoy driven by insatiable demand for Hopper/Blackwell architectures."}
{"rank": 2, "ticker": "MSFT", "company": "Microsoft Corp.", "conviction_score": 235, "outlook": "Strong Buy", "rationale": "Exceptional financial strength (AAA rated) with diversified dominance in Cloud (Azure) and productivity. AI integration across the stack provides a multi-year growth vector."}
{"rank": 3, "ticker": "LLY", "company": "Eli Lilly and Company", "conviction_score": 225, "outlook": "Strong Buy", "rationale": "Market leadership in high-growth GLP-1 (obesity/diabetes) therapeutic area. Strong pipeline execution offsets patent cliffs for older portfolio assets."}
{"rank": 4, "ticker": "AMZN", "company": "Amazon.com Inc.", "conviction_score": 215, "outlook": "Buy", "rationale": "Dual engines of AWS cloud leadership and retail scale provide massive cash flow generation. Advertising segment is a high-margin hidden gem growing rapidly."}
{"rank": 5, "ticker": "GOOGL", "company": "Alphabet Inc.", "conviction_score": 205, "outlook": "Buy", "rationale": "Search monopoly remains a cash cow despite regulatory noise. DeepMind integration and cloud growth provide resilience against AI disruption fears."}
{"rank": 6, "ticker": "V", "company": "Visa Inc.", "conviction_score": 195, "outlook": "Buy", "rationale": "Unrivaled 'toll road' business model with high barriers to entry. Inflation-hedged revenue stream with superior margins and low capital intensity."}
{"rank": 7, "ticker": "COST", "company": "Costco Wholesale Corp.", "conviction_score": 185, "outlook": "Buy", "rationale": "Best-in-class retail model with extreme customer loyalty (membership renewal >90%). Resilient to economic downturns due to value proposition."}
{"rank": 8, "ticker": "JPM", "company": "JPMorgan Chase & Co.", "conviction_score": 175, "outlook": "Buy", "rationale": "The fortress balance sheet of banking. G-SIB scale advantages allow it to out-invest peers in technology and capture market share in every segment."}
{"rank": 9, "ticker": "BRK.B", "company": "Berkshire Hathaway Inc.", "conviction_score": 170, "outlook": "Buy", "rationale": "Ultimate defensive play with massive cash optionality. Insurance float provides practically free capital for opportunistic deployment during volatility."}
{"rank": 10, "ticker": "UNH", "company": "UnitedHealth Group Inc.", "conviction_score": 160, "outlook": "Buy", "rationale": "Vertically integrated healthcare giant (Optum + Insurance) capturing value across the entire patient journey. Data analytics capabilities create a wide moat."}
{"rank": 11, "ticker": "AVGO", "company": "Broadcom Inc.", "conviction_score": 140, "outlook": "Buy", "rationale": "Strategic M&A machine with high-margin semiconductor and software franchises. Strong free cash flow supports rapid deleveraging and dividends."}
{"rank": 12, "ticker": "KO", "company": "Coca-Cola Co.", "conviction_score": 135, "outlook": "Moderate Buy", "rationale": "Defensive staple with unparalleled distribution network. Pricing power has proven resilient against inflation, offering stable compounding returns."}
{"rank": 13, "ticker": "AAPL", "company": "Apple Inc.", "conviction_score": 110, "outlook": "Moderate Buy", "rationale": "Massive install base and services growth are positives, but tempered by intensifying global antitrust scrutiny and geopolitical supply chain risks."}
{"rank": 14, "ticker": "CRM", "company": "Salesforce, Inc.", "conviction_score": 105, "outlook": "Moderate Buy", "rationale": "Stickiest product in enterprise software (CRM), but facing growth deceleration. Focus on profitability and margins is the new catalyst."}
{"rank": 15, "ticker": "META", "company": "Meta Platforms, Inc.", "conviction_score": 80, "outlook": "Hold/Buy", "rationale": "Core ad business is a cash machine, but massive Capex spend on AI/Metaverse creates uncertainty on return on invested capital (ROIC)."}
{"rank": 16, "ticker": "NFLX", "company": "Netflix, Inc.", "conviction_score": 60, "outlook": "Hold", "rationale": "Won the streaming wars, but now faces a mature, saturated market. Growth must come from ad-tiers and cracking down on sharing, which has limits."}
{"rank": 17, "ticker": "CSCO", "company": "Cisco Systems, Inc.", "conviction_score": -40, "outlook": "Weak Hold", "rationale": "Legacy hardware business faces secular headwinds from cloud migration and software-defined networking. Turnaround to software is slow."}
{"rank": 18, "ticker": "TSLA", "company": "Tesla, Inc.", "conviction_score": -60, "outlook": "Sell/Avoid", "rationale": "Valuation disconnected from auto-industry fundamentals. Margins compressing due to competition; governance and 'key person' risks are elevated."}
{"rank": 19, "ticker": "BA", "company": "Boeing Co.", "conviction_score": -90, "outlook": "Sell", "rationale": "Severe execution and quality control crises have eroded trust and balance sheet. Regulatory oversight will hamper production ramp-up for years."}
{"rank": 20, "ticker": "DIS", "company": "The Walt Disney Company", "conviction_score": -110, "outlook": "Sell", "rationale": "Struggling to make streaming profitable while high-margin linear TV business collapses. Succession uncertainty and theme park pricing fatigue add risk."}
{"rank": 21, "ticker": "INTC", "company": "Intel Corporation", "conviction_score": -140, "outlook": "Strong Sell", "rationale": "Capital-intensive IDM 2.0 strategy is risky. Losing market share in core Data Center/PC markets to AMD and ARM while burning cash on fabs."}
{"rank": 22, "ticker": "WBD", "company": "Warner Bros. Discovery", "conviction_score": -160, "outlook": "Strong Sell", "rationale": "Crushed by debt load from merger. Exposure to declining linear TV assets is toxic in the current media environment; lacks scale of Netflix."}