{
  "PriceToEarningsRatio": {
    "definition": "The Price-to-Earnings (P/E) ratio is a valuation metric that measures the current share price relative to its per-share earnings (EPS).",
    "formula": "P/E Ratio = Market Price per Share / Earnings per Share",
    "interpretation": "A high P/E ratio suggests that investors are expecting higher earnings growth in the future compared to companies with lower P/E ratios.  However, a very high P/E can also indicate that a stock is overvalued.",
    "example": {
      "company": "Tech Innovators Inc.",
      "marketPrice": 150,
      "earningsPerShare": 10,
      "peRatio": 15
    },
    "sources": ["Investopedia", "Wikipedia"]
  },
  "RelativeStrengthIndex": {
    "definition": "The relative strength index (RSI) is a momentum indicator that measures the speed and change of price movements. It oscillates between zero and 100.",
    "formula": "RSI = 100 - (100 / (1 + Average Gain / Average Loss))",
    "interpretation": "RSI values above 70 are often considered overbought, suggesting that the asset may be overvalued and could experience a price correction. Values below 30 are considered oversold, indicating that the asset may be undervalued and could see a price rebound.",
    "example": {
      "company": "Tech Innovators Inc.",
      "averageGain": 5,
      "averageLoss": 2,
      "rsi": 71.43
    },
    "sources": ["Investopedia", "Wikipedia"]
  },
  "AnalystSentiment": {
    "definition": "Analyst sentiment represents the overall opinion of financial analysts regarding a particular stock or the market in general.",
    "interpretation": {
      "positive": "Positive sentiment suggests that analysts are optimistic about the future prospects of the company or the market.  This can be based on factors such as strong financial performance, positive industry trends, or anticipated product launches.",
      "negative": "Negative sentiment indicates that analysts have concerns about the company's or the market's future performance. This might be due to factors like declining earnings, increased competition, or macroeconomic uncertainties.",
      "neutral": "Neutral sentiment implies that analysts are neither particularly optimistic nor pessimistic.  They may see a mixed outlook or believe that the current situation is likely to continue."
    }
  },
  "EarningsPerShare": {
    "definition": "Earnings per share (EPS) is a measure of a company's profitability. It indicates how much profit a company has generated for each outstanding share of its stock.",
    "formula": "EPS = (Net Income - Preferred Dividends) / Weighted Average Shares Outstanding",
    "interpretation": "Higher EPS generally indicates higher profitability and is a positive sign for investors.  However, it's important to compare EPS across companies in the same industry to get a meaningful perspective.",
    "example": {
      "company": "Tech Innovators Inc.",
      "netIncome": 1000000,
      "preferredDividends": 0,
      "sharesOutstanding": 100000,
      "eps": 10
    }
  },
  "MovingAverage": {
    "definition": "A moving average is a technical indicator that smooths out price data by creating an average price over a specified period. It
