[
  {
    "id": "train_001",
    "input": "Analyze the liquidity risk for TechCorp Inc. given a current ratio of 0.8.",
    "output": "Based on the provided current ratio of 0.8, TechCorp Inc. faces significant liquidity risk. A ratio below 1.0 indicates that the company's short-term assets are insufficient to cover its short-term liabilities. This suggests potential difficulties in meeting immediate financial obligations without securing additional financing or liquidating long-term assets. Further analysis of the quick ratio and operating cash flow is recommended to assess the severity of the situation.",
    "weight": 1.0
  },
  {
    "id": "train_002",
    "input": "What is the impact of rising interest rates on a bond portfolio with a duration of 5 years?",
    "output": "A bond portfolio with a duration of 5 years will experience a decline in value as interest rates rise. Specifically, for every 1% increase in interest rates, the portfolio's value is expected to decrease by approximately 5%. This inverse relationship is a fundamental principle of fixed-income investing known as interest rate risk.",
    "weight": 0.8
  },
  {
    "id": "train_003",
    "input": "Explain the concept of 'Greenwashing' in the context of ESG investing.",
    "output": "Greenwashing refers to the deceptive practice where a company or investment fund exaggerates or falsely claims to be environmentally friendly, sustainable, or compliant with ESG (Environmental, Social, and Governance) criteria. This is done to attract socially conscious investors or consumers without making significant efforts to reduce environmental impact. It undermines the integrity of ESG investing by misdirecting capital away from genuinely sustainable initiatives.",
    "weight": 0.9
  },
  {
    "id": "train_004",
    "input": "Calculate the EBITDA for a company with Net Income of $10M, Interest of $2M, Taxes of $3M, and Depreciation/Amortization of $5M.",
    "output": "EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) is calculated by adding Interest, Taxes, and Depreciation/Amortization back to Net Income.\n\nCalculation:\nNet Income: $10M\n+ Interest: $2M\n+ Taxes: $3M\n+ Depreciation/Amortization: $5M\n\nEBITDA = $10M + $2M + $3M + $5M = $20M.",
    "weight": 0.95
  }
]
