[
  {
    "id": "train_001",
    "input": "Analyze the liquidity risk for TechCorp Inc. given a current ratio of 0.8.",
    "output": "Based on the provided current ratio of 0.8, TechCorp Inc. faces significant liquidity risk. A ratio below 1.0 indicates that the company's short-term assets are insufficient to cover its short-term liabilities. This suggests potential difficulties in meeting immediate financial obligations without securing additional financing or liquidating long-term assets. Further analysis of the quick ratio and operating cash flow is recommended to assess the severity of the situation.",
    "weight": 1.0
  },
  {
    "id": "train_002",
    "input": "What is the impact of rising interest rates on a bond portfolio with a duration of 5 years?",
    "output": "A bond portfolio with a duration of 5 years will experience a decline in value as interest rates rise. Specifically, for every 1% increase in interest rates, the portfolio's value is expected to decrease by approximately 5%. This inverse relationship is a fundamental principle of fixed-income investing known as interest rate risk.",
    "weight": 0.8
  },
  {
    "id": "train_003",
    "input": "Explain the concept of 'Greenwashing' in the context of ESG investing.",
    "output": "Greenwashing refers to the deceptive practice where a company or investment fund exaggerates or falsely claims to be environmentally friendly, sustainable, or compliant with ESG (Environmental, Social, and Governance) criteria. This is done to attract socially conscious investors or consumers without making significant efforts to reduce environmental impact. It undermines the integrity of ESG investing by misdirecting capital away from genuinely sustainable initiatives.",
    "weight": 0.9
  },
  {
    "id": "train_004",
    "input": "Calculate the EBITDA for a company with Net Income of $10M, Interest of $2M, Taxes of $3M, and Depreciation/Amortization of $5M.",
    "output": "EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) is calculated by adding Interest, Taxes, and Depreciation/Amortization back to Net Income.\n\nCalculation:\nNet Income: $10M\n+ Interest: $2M\n+ Taxes: $3M\n+ Depreciation/Amortization: $5M\n\nEBITDA = $10M + $2M + $3M + $5M = $20M.",
    "weight": 0.95
  },
  {
    "id": "train_005",
    "input": "Analyze the impact of rising interest rates on tech growth stocks.",
    "output": "Rising interest rates typically negatively impact tech growth stocks because their valuations are often based on future cash flows, which are discounted at a higher rate when yields rise. This leads to a compression in P/E multiples. Additionally, higher borrowing costs can hinder expansion plans for capital-intensive tech firms.",
    "weight": 1.2,
    "tags": ["macro", "tech", "valuation"]
  },
  {
    "id": "train_006",
    "input": "What is the key risk for sovereign debt in emerging markets currently?",
    "output": "The primary risk for emerging market sovereign debt is currency depreciation against the USD, which increases the cost of servicing dollar-denominated debt. This is exacerbated by capital flight as investors seek safer yields in developed markets.",
    "weight": 1.0,
    "tags": ["sovereign", "risk", "fx"]
  },
  {
    "id": "train_007",
    "input": "Summarize the Q3 2025 earnings sentiment for the banking sector.",
    "output": "Q3 2025 banking sector earnings showed resilience in net interest margins, but loan growth was sluggish due to tighter credit standards. Investment banking revenues rebounded slightly, driven by M&A activity, while trading revenues remained flat. Overall sentiment is cautiously optimistic but wary of potential regulatory headwinds.",
    "weight": 0.8,
    "tags": ["earnings", "banking", "sentiment"]
  },
  {
    "id": "train_008",
    "input": "Explain the concept of 'Liquidity Traps' in the context of the 2024 recession fears.",
    "output": "A liquidity trap occurs when monetary policy becomes ineffective because nominal interest rates are near zero and consumers prefer to save rather than invest or spend. In the context of 2024, fears arose that despite rate cuts, demand would not recover due to high household debt and pessimistic economic outlooks, rendering central bank stimulus less potent.",
    "weight": 1.5,
    "tags": ["theory", "macro", "crisis"]
  },
  {
    "id": "train_009",
    "input": "Evaluate the ESG score impact on portfolio performance.",
    "output": "Empirical data suggests a mixed impact. While high ESG scores can mitigate tail risks (e.g., regulatory fines, environmental disasters), they may also limit exposure to high-yield sectors like energy. However, over the long term, ESG-integrated portfolios have shown comparable or slightly superior risk-adjusted returns due to better quality factors.",
    "weight": 0.9,
    "tags": ["esg", "portfolio", "strategy"]
  }
]